In [1]:
import pandas as pd

In [22]:
df = pd.read_csv('Dataset/StudentsPerformance1.csv')

In [23]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN
1,female,group C,some college,standard,completed,69.0,90.0,88.0,NaN
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,NaN
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN
4,male,group C,some college,standard,none,76.0,78.0,75.0,NaN

In [24]:
# How many unique values r present in a column
df['gender'].unique()

array(['female', 'male'], dtype=object)

In [25]:
df['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

# Turning categorical variables into numeric

In [26]:
#ðŸ›‘ Using replace:
# df['gender'] = df['gender'].replace(['male', 'female'], [1,0])

# df['gender'].replace(['male', 'female'], [1, 0], inplace=True)
# print(df['gender'])

In [27]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN
1,female,group C,some college,standard,completed,69.0,90.0,88.0,NaN
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,NaN
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN
4,male,group C,some college,standard,none,76.0,78.0,75.0,NaN

In [28]:
#ðŸ›‘ Using 'get_dummies' method:

# dummies = pd.get_dummies(df['gender'])

# # # concat the two dataframes -> df and dummies
# df = pd.concat([df, dummies], axis='columns')

# # # remove the original gender column
# df.drop(['gender'], axis = 1, inplace=True)

In [29]:
# concat.head()
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
0,female,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN
1,female,group C,some college,standard,completed,69.0,90.0,88.0,NaN
2,female,group B,master's degree,standard,none,90.0,95.0,93.0,NaN
3,male,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN
4,male,group C,some college,standard,none,76.0,78.0,75.0,NaN

In [30]:
# Label Encoding
# !pip install scikit-learn
from sklearn import preprocessing

In [31]:
label_encoder = preprocessing.LabelEncoder()
df['gender'] = label_encoder.fit_transform(df['gender'])

In [32]:
df['gender'].unique()

array([0, 1])

In [33]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,grade
0,0,group B,bachelor's degree,standard,none,72.0,72.0,74.0,NaN
1,0,group C,some college,standard,completed,69.0,90.0,88.0,NaN
2,0,group B,master's degree,standard,none,90.0,95.0,93.0,NaN
3,1,group A,associate's degree,free/reduced,none,47.0,57.0,44.0,NaN
4,1,group C,some college,standard,none,76.0,78.0,75.0,NaN